<?php

/***************************************************************************************************/

namespace OneRpcClient\Tcp\App\Tests\Rpc{
   /**

 * 类注释
---------------------------------------------------------------
    * @method mixed __construct($i)
---------------------------------------------------------------
     * 测试插入两个不同数据库的表的事务表现
     * @param $age,年龄 b
     * @param $name,姓名 必须
     * @return int 自增ID
    * @method int insert(int $age,string $name)
---------------------------------------------------------------
     * 回滚
    * @method mixed rollBack()
---------------------------------------------------------------
     * 提交
    * @method mixed commit()
---------------------------------------------------------------
    * @method mixed query()
---------------------------------------------------------------
    * @method mixed join()
---------------------------------------------------------------
    * @method mixed add($v)
---------------------------------------------------------------
    * @method mixed sub($v)
---------------------------------------------------------------
    * @method mixed mul($v)
---------------------------------------------------------------
    * @method mixed div($v)
---------------------------------------------------------------
    * @method mixed get()
    */
    class Abc extends \OneRpcClient\Tcp\RpcClientTcp { 
        protected $service_name = 'super-admin';
        protected $_remote_class_name = 'App\Tests\Rpc\Abc';
    } 
} 

/***************************************************************************************************/

namespace OneRpcClient\Tcp\App\Tests\Rpc{
   /**

 * 类注释2
---------------------------------------------------------------
    * @method mixed __construct($i)
---------------------------------------------------------------
     * 测试插入两个不同数据库的表的事务表现
     * @param $age,年龄 b
     * @param $name,姓名 必须
     * @return int 自增ID
    * @method int insert(int $age,string $name)
---------------------------------------------------------------
     * 回滚
    * @method mixed rollBack()
---------------------------------------------------------------
     * 提交
    * @method mixed commit()
---------------------------------------------------------------
    * @method mixed query()
---------------------------------------------------------------
    * @method mixed add($v)
---------------------------------------------------------------
    * @method mixed sub($v)
---------------------------------------------------------------
    * @method mixed mul($v)
---------------------------------------------------------------
    * @method mixed div($v)
---------------------------------------------------------------
    * @method mixed get()
    */
    class Abc2 extends \OneRpcClient\Tcp\RpcClientTcp { 
        protected $service_name = 'super-admin';
        protected $_remote_class_name = 'App\Tests\Rpc\Abc2';
    } 
} 